; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=89, out_folder=htg/blocksworld/training, instance_id=69, seed=2093, goal_proportion=0.1

(define (problem blocksworld-69)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b82)
    (on b82 b3)
    (on b3 b50)
    (on b50 b6)
    (on b6 b72)
    (on b72 b31)
    (on b31 b54)
    (on b54 b13)
    (on b13 b24)
    (on b24 b86)
    (on b86 b58)
    (on b58 b63)
    (on b63 b51)
    (on-table b51)
    (clear b80)
    (on b80 b76)
    (on-table b76)
    (clear b64)
    (on b64 b89)
    (on-table b89)
    (clear b11)
    (on-table b11)
    (clear b87)
    (on b87 b22)
    (on b22 b75)
    (on b75 b9)
    (on-table b9)
    (clear b28)
    (on b28 b67)
    (on b67 b83)
    (on-table b83)
    (clear b40)
    (on b40 b68)
    (on b68 b79)
    (on b79 b10)
    (on b10 b35)
    (on-table b35)
    (clear b5)
    (on b5 b30)
    (on b30 b8)
    (on-table b8)
    (clear b41)
    (on-table b41)
    (clear b14)
    (on-table b14)
    (clear b12)
    (on-table b12)
    (clear b77)
    (on-table b77)
    (clear b73)
    (on b73 b60)
    (on b60 b47)
    (on b47 b65)
    (on-table b65)
    (clear b62)
    (on b62 b27)
    (on b27 b59)
    (on-table b59)
    (clear b78)
    (on b78 b15)
    (on-table b15)
    (clear b34)
    (on b34 b23)
    (on b23 b44)
    (on b44 b29)
    (on b29 b39)
    (on-table b39)
    (clear b42)
    (on-table b42)
    (clear b88)
    (on b88 b84)
    (on b84 b38)
    (on b38 b56)
    (on b56 b85)
    (on b85 b49)
    (on-table b49)
    (clear b48)
    (on-table b48)
    (clear b36)
    (on b36 b57)
    (on b57 b45)
    (on b45 b2)
    (on b2 b33)
    (on-table b33)
    (clear b19)
    (on b19 b7)
    (on-table b7)
    (clear b32)
    (on b32 b66)
    (on-table b66)
    (clear b17)
    (on b17 b37)
    (on b37 b1)
    (on b1 b26)
    (on-table b26)
    (clear b74)
    (on b74 b61)
    (on b61 b70)
    (on b70 b69)
    (on-table b69)
    (clear b18)
    (on b18 b53)
    (on b53 b21)
    (on b21 b43)
    (on-table b43)
    (clear b25)
    (on b25 b52)
    (on b52 b81)
    (on b81 b20)
    (on b20 b4)
    (on b4 b46)
    (on b46 b71)
    (on b71 b55)
    (on-table b55))
 (:goal  (and 
    (clear b1)
    (on b1 b7)
    (on b7 b8)
    (on-table b8)
    (clear b2)
    (on-table b2)
    (clear b4)
    (on b4 b3)
    (on b3 b6)
    (on b6 b5)
    (on-table b5))))

; plan
1. (unstack b5 b30)
   deleted: (on b5 b30) (clear b5) (arm-empty)
   added: (holding b5) (clear b30)
   goals met: 1 of 11
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 11
3. (unstack b17 b37)
   deleted: (on b17 b37) (clear b17) (arm-empty)
   added: (holding b17) (clear b37)
   goals met: 2 of 11
4. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 11
5. (unstack b37 b1)
   deleted: (on b37 b1) (clear b37) (arm-empty)
   added: (holding b37) (clear b1)
   goals met: 3 of 11
6. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 11
7. (unstack b36 b57)
   deleted: (on b36 b57) (clear b36) (arm-empty)
   added: (holding b36) (clear b57)
   goals met: 3 of 11
8. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 11
9. (unstack b57 b45)
   deleted: (on b57 b45) (clear b57) (arm-empty)
   added: (holding b57) (clear b45)
   goals met: 3 of 11
10. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 3 of 11
11. (unstack b45 b2)
   deleted: (on b45 b2) (clear b45) (arm-empty)
   added: (holding b45) (clear b2)
   goals met: 4 of 11
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 4 of 11
13. (unstack b2 b33)
   deleted: (on b2 b33) (clear b2) (arm-empty)
   added: (holding b2) (clear b33)
   goals met: 3 of 11
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 11
15. (unstack b30 b8)
   deleted: (on b30 b8) (clear b30) (arm-empty)
   added: (holding b30) (clear b8)
   goals met: 5 of 11
16. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 5 of 11
17. (unstack b19 b7)
   deleted: (on b19 b7) (clear b19) (arm-empty)
   added: (holding b19) (clear b7)
   goals met: 5 of 11
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 11
19. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 5 of 11
20. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 6 of 11
21. (unstack b1 b26)
   deleted: (on b1 b26) (clear b1) (arm-empty)
   added: (holding b1) (clear b26)
   goals met: 5 of 11
22. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 7 of 11
23. (unstack b25 b52)
   deleted: (on b25 b52) (clear b25) (arm-empty)
   added: (holding b25) (clear b52)
   goals met: 7 of 11
24. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 7 of 11
25. (unstack b52 b81)
   deleted: (on b52 b81) (clear b52) (arm-empty)
   added: (holding b52) (clear b81)
   goals met: 7 of 11
26. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 7 of 11
27. (unstack b81 b20)
   deleted: (on b81 b20) (clear b81) (arm-empty)
   added: (holding b81) (clear b20)
   goals met: 7 of 11
28. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 7 of 11
29. (unstack b20 b4)
   deleted: (on b20 b4) (clear b20) (arm-empty)
   added: (holding b20) (clear b4)
   goals met: 8 of 11
30. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 8 of 11
31. (unstack b16 b82)
   deleted: (on b16 b82) (clear b16) (arm-empty)
   added: (holding b16) (clear b82)
   goals met: 8 of 11
32. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 8 of 11
33. (unstack b82 b3)
   deleted: (on b82 b3) (clear b82) (arm-empty)
   added: (holding b82) (clear b3)
   goals met: 8 of 11
34. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 8 of 11
35. (unstack b3 b50)
   deleted: (on b3 b50) (clear b3) (arm-empty)
   added: (holding b3) (clear b50)
   goals met: 8 of 11
36. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 8 of 11
37. (unstack b50 b6)
   deleted: (on b50 b6) (clear b50) (arm-empty)
   added: (holding b50) (clear b6)
   goals met: 8 of 11
38. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 8 of 11
39. (unstack b4 b46)
   deleted: (on b4 b46) (clear b4) (arm-empty)
   added: (holding b4) (clear b46)
   goals met: 7 of 11
40. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 9 of 11
41. (unstack b6 b72)
   deleted: (on b6 b72) (clear b6) (arm-empty)
   added: (holding b6) (clear b72)
   goals met: 9 of 11
42. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 10 of 11
43. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 8 of 11
44. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 9 of 11
45. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 11
46. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 10 of 11
47. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 11
48. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 11 of 11
